{
  "company_information": "",
  "character_878698": {
    "name": "Niels Andriesse",
    "id": "878698",
    "scraped_data": "\n================ SCRAPED PROFILE DATA ================\nNAME:     Niels Andriesse\nHEADLINE: Co-Founder & Co-CTO @ Supermoon AI\nLOCATION: 1st\nPHOTO URL: https://media.licdn.com/dms/image/v2/D4E03AQGeqElumAwBIw/profile-displayphoto-shrink_200_200/profile-displayphoto-shrink_200_200/0/1701612551531?e=1767225600&v=beta&t=wfJ8QzwA5JWrw2QWDYbWR_zr9eULGDK_wRJZxL1-uo4\n\n[ABOUT]\nCo-founder and co-CTO of Supermoon AI: an AI solutions product company. Co-founder of Superluminal: together with my co-founder I built and shipped a complete AI code interpreter before OpenAI. Pioneer W22/23. Acquired by Supermoon AI. Author of Neuron: an open-source experiment in using an evolutionary algorithm for the optimization of a neural network's hyperparameters. Co-author of Swift Numenta: an open-source, Swift version of Numenta's \"thousand brains\" approach to AI. Author of TechGPT: an open-source experiment in using LLMs to find new discoveries in the intersections between different fields of study. Lead engineer at Session: a fully decentralized, E2EE, onion-routed messenger. Scaled from 0 to 250,000+ active users. Today Session has 1M+ active users. Senior iOS engineer and later lead Android engineer at Tellus: a comprehensive real estate FinTech platform for all parties involved in real estate (backed by a16z). Freelance software engineer at Toptal: a freelancing network that accepts only the top 3% of freelance talent. I worked on various projects such as DynamiCare Health. Co-founder of Archimedes: the graphing calculator re-invented for the 21st century. Scaled from ~10k users to ~250k users. Archimedes is still used in classrooms around the world today. Aerospace engineering at TU Delft (2011 - 2014). Worked on several interesting projects such as software for automatic transfer orbit optimization, a complete design of the internal structure of an aerobatic racing aircraft, and software for the automatic preliminary design of an arbitrary wing. …see more\n\n[EXPERIENCE]\n  1. Co-Founder & Co-CTO | Supermoon AI · Full-time | Dec 2023 - Present · 2 yrs 1 mo | London Area, United Kingdom\n  2. Co-Founder & CEO | Superluminal (Pioneer W22/23) · Full-time | Sep 2021 - Present · 4 yrs 4 mos | London, England, United Kingdom | An AI agent for data science that iteratively writes, debugs & executes Python code to perform the majority of tasks you'd expect a human data analyst to be able to perform. Part of the Pioneer W22/23 batch. Acquired by Supermoon AI.\n  3. Lead iOS Engineer | Lead Android Engineer | Product Lead | Session | Apr 2019 - Jul 2021 · 2 yrs 4 mos | Melbourne, Australia | A fully decentralized, privately routed, and end-to-end encrypted private messenger. I was the main contributor on both iOS and Android and developed most of both applications, in addition to developing part of the back-end. I was also responsible for ensuring the security and privacy of the application (audited by QuarksLab) and managing the team. When I joined, Session hadn't yet launched on mobile. By the time I left it had 250,000+ active users and a rating of 4.1/5 on Google Play and 4.4/5 on the App Store. Today Session has 1M+ active users and is one of the most used decentralized applications. | Session – Send Messages, Not Metadata. | Session is a private messenger that aims to remove any chance of metadata collection by routing all messages through an onion routing network.\n  4. Tellus | 1 yr 11 mos | San Francisco Bay Area | Lead Android Engineer | May 2018 - Jan 2019 · 9 mos | Tellus | Real Estate Platform | Invest | Home Loans | Collect Rent Online | Free Tenant Screening | Tellus is a comprehensive real estate management platform for investors, homeowners, landlords, renters, property managers, agents, and service professionals. Invest in fractions of residential real estate debt, apply for a home equity loan, and use... | Senior iOS Engineer | Mar 2017 - May 2018 · 1 yr 3 mos\n  5. Freelance Software Engineer | Toptal | Apr 2016 - Mar 2017 · 1 yr | Global | At Toptal, I worked on various projects across BioTech and social media. | We connect top talent with exceptional clients.\n\n[EDUCATION]\n  1. Delft University of Technology | Bachelor's Degree, Aerospace Engineering | 2011 - 2014 | Calculus, Probability & Statistics, Applied Numerical Analysis, Computational Modelling, Linear Algebra, Structural Analysis, Vibrational Analysis, Flight & Orbital Mechanics, Thermodynamics, Propulsion Design, Sub- & Supersonic Aerodynamic Design, Flight Dynamics, Control Theory, Programming, Instrumentation & Signals, Experimental Research & Data Analysis, Simulation, Verification & Validation.\n  2. KTH Royal Institute of Technology | Erasmus Minor, Entrepreneurship | 2013 - 2014\n\n[SKILLS]\n  No data found (or section not loaded).\n\n======================================================\n",
    "persona": ""
  },
  "character_048991": {
    "name": "Abdussalam Popoola",
    "id": "048991",
    "scraped_data": "\n================ SCRAPED PROFILE DATA ================\nNAME:     Abdussalam Popoola\nHEADLINE: Design Engineer | Certified Webflow Developer | Penultimate Computer Science Student @University of Chester\nLOCATION: 1st\nPHOTO URL: https://media.licdn.com/dms/image/v2/D4D03AQGMfewTCpYhIg/profile-displayphoto-shrink_200_200/B4DZQIXwQ3GgAg-/0/1735307232663?e=1767225600&v=beta&t=kKuhGjMC792mTXy4_6JCWN4666Einie57UJ67oRi8eU\n\n[ABOUT]\nHi, I’m Abdussalam 👋🏽 A Web Designer & Webflow Developer helping brands bring bold ideas to life through beautiful, functional websites. I specialize in building high-converting websites for creative agencies, AI startups, SaaS companies, and entrepreneurs—combining clean design with seamless Webflow development. With years of experience and a focus on visual storytelling, performance, and responsiveness, I help businesses stand out online and drive real results. Here’s what you get when we work together: ✔ Custom Website Design tailored to your brand ✔ Full Webflow Development—from scratch or migration ✔ Advanced interactions (GSAP, Finsweet, custom code) ✔ Seamless Webflow CMS integration ✔ Pixel-perfect Figma to Webflow conversion 🔥 Whether you need a full site, landing page, or MVP—I’m here to bring your vision to life. Let’s build something great together. 🎨 Portfolio: www.abdussalampopoola.com 📬 Let’s connect: contact@abdussalampopoola.com …see more\n\n[EXPERIENCE]\n  1. Webflow Developer | abdussalampopoola.com · Freelance | Nov 2023 - Present · 2 yrs 2 mos | United Kingom\n  2. Webflow Designer | ViDesigns · Contract | Nov 2024 - Jun 2025 · 8 mos | London Area, United Kingdom · Hybrid | - Collaborated with the design team on client projects, learning professional workflows and design critique processes | - Contributed to user interface designs and Webflow implementations for multiple client projects | - Participated in team meetings, presenting design rationale and incorporating feedback from senior designers | - Gained experience working within agency timelines and quality standards | Webflow development, Figma (Software) and +3 skills\n  3. Student Outreach Advocate | University of Chester · Part-time | Dec 2024 - Apr 2025 · 5 mos | Cheshire West And Chester, England, United Kingdom · On-site | As a University Outreach Advocate, I engaged with students from Year 7 to Year 12, sharing insights about university life, the benefits of higher education, and future career opportunities. I participated in school visits, student tours, and open days, helping younger students understand what to expect from university and how to navigate the application process. Through these experiences, I developed strong public speaking, communication, and mentoring skills, while representing the university in a positive and inspiring way.\n  4. UX Designer | Freelance | Jul 2022 - Sep 2024 · 2 yrs 3 mos | Remote | I help startups and small businesses build products or improve the current ones to have an optimal user experience while solving business problems | User Interface Design, Prototyping and +6 skills | Redesign of Risevest KYC flow — UX Design case study | A case study on the KYC flow of a FinTech app, i shared how i increased the user onboarding rate in ~5 mins\n  5. Product Designer | HNG Tech · Internship | Jul 2024 - Aug 2024 · 2 mos | Remote · Remote | As a UX Design Intern, I had the opportunity to immerse myself in a fast-paced, startup-like environment where I contributed across the full spectrum of the design process. I designed user-centered interfaces for both mobile and web applications, ensuring they were intuitive and visually appealing. My work included creating interactive prototypes and micro-interactions in Figma to enhance the user experience and drive engagement. | I collaborated closely with product managers and developers, bridging the gap between design and development to ensure that our vision was effectively implemented. My role involved conducting user research, translating insights into wireframes, and iterating on designs based on feedback and testing. | This hands-on experience not only strengthened my technical skills in UI/UX design, prototyping, and interaction design but also honed my ability to thrive in an agile and collaborative environment. I'm excited to bring this expertise to new challenges in the UX/UI design field. | User Interface Design, Prototyping and +7 skills\n\n[EDUCATION]\n  1. University of Chester | Bachelor of Science - BS, Computer Science | Aug 2024 - Jul 2027\n  2. Hamm-Lippstadt University of Applied Sciences | Bachelor of Engineering - BE, Electrical and Electronics Engineering | Sep 2023 - Jan 2024\n\n[SKILLS]\n  1. Jitter | Webflow Designer at ViDesigns | Endorse\n  2. User Experience Design (UED) | Webflow Designer at ViDesigns | Endorse\n\n======================================================\n",
    "persona": ""
  },
  "character_947153": {
    "name": "Botir Khaltaev",
    "id": "947153",
    "scraped_data": "\n================ SCRAPED PROFILE DATA ================\nNAME:     Botir Khaltaev\nHEADLINE: research engineer @ snyk | founder @ adaptive | cs @ rhul 2026\nLOCATION: He/Him\nPHOTO URL: https://media.licdn.com/dms/image/v2/D4D03AQFIjtxn1fE23w/profile-displayphoto-scale_200_200/B4DZiQ9ENoH8AY-/0/1754778585667?e=1767225600&v=beta&t=4Ejn-UTI3TBfqZdLUtd35nbpisHX-okmxlj3ZZmjQCg\n\n[ABOUT]\nI am a third-year Computer Science student at the Royal Holloway University of London, specializing in AI and deeply passionate about systems engineering. I have a strong academic background, having excelled in the IB Diploma at NIST International School, where I studied Higher Level Computer Science, Economics, and Business. I am enthusiastic about technology and continually learning new skills. My professional experience includes roles as an AI Training Infrastructure SWE at Meta FAIR and an Infrastructure Software Engineer for Eutelsat OneWeb. I was previously an intern at SquaredUp and at Snyk R&D Engineering team as a Research Engineer intern working on LLM infra (inference/training) My goal is to leverage my knowledge and experience to create innovative and impactful solutions for the tech industry, particularly within the realm of robust and efficient systems. …see more\n\n[EXPERIENCE]\n  1. Research Ambassador | Thinking About Thinking · Part-time | Oct 2025 - Present · 3 mos | London, United Kingdom · On-site | I serve as a Research Ambassador for Thinking About Thinking Inc., the nonprofit behind the AE Global Summit on Open Problems for AI. | In this role, I help connect researchers, policymakers, and industry leaders from institutions like DeepMind, Meta, Microsoft, NVIDIA, Oxford, Harvard, and MIT to tackle the most important scientific and societal challenges in AI. | I focus on broadening researcher access to the Summit, building academic partnerships, and supporting the development of programs that promote open, cross-disciplinary collaboration. | My work centers on advancing dialogue in areas such as AI alignment, interpretability, infrastructure, and global AI governance, helping ensure that the world’s smartest people are talking about the world’s hardest problems.\n  2. Research Engineer | Snyk · Internship | Jul 2025 - Present · 6 mos | London Area, United Kingdom · Hybrid\n  3. Co-Founder | Adaptive · Part-time | Feb 2025 - Present · 11 mos | model routing for AI coding\n  4. Research Assistant | Royal Holloway, University of London · Part-time | Feb 2025 - Jul 2025 · 6 mos | Egham, England, United Kingdom · On-site | Built an internal AI-enabled web application to support research commercialisation and help academics adopt AI tooling effectively within their workflows. | Developed core application features using Next.js and TypeScript | Integrated AI models to automate and streamline research discovery and innovation workflows | Collaborated with research staff to gather requirements and translate them into usable product features | Designed front-end UI components and internal user flows for researchers and innovation managers | Assisted with deployment, testing, and iterative improvements based on feedback | Nextjs, TypeScript and +3 skills\n  5. Software Engineer | SquaredUp · Internship | Sep 2024 - Jul 2025 · 11 mos | London Area, United Kingdom · Remote | helped me get this job | Built and improved modular dashboarding workflows, enabling customizable starter dashboards across multiple data sources — accelerating customer onboarding and time-to-insight. | Delivered sub-domain access control for authorized email domains, supporting secure, multi-team workspace segregation and enterprise-grade governance. | Optimized the dashboard engine for performance and resilience, including persistent visualization configs that survive schema changes to prevent user re-work. | Integrated customer data sources with Azure Cosmos DB, powering scalable workspace-bound data views for enterprise deployments. | Developed and maintained unit tests (Vitest) and end-to-end tests (Cypress) for all shipped features, improving reliability and deployment confidence. | Contributed to a serverless AWS backend, enhancing real-time data access and scalable API flows. | Partnered with Customer Success to troubleshoot critical issues, gather requirements, and ship fixes directly impacting enterprise usage and satisfaction. | Amazon Web Services (AWS), Cypress and +3 skills\n\n[EDUCATION]\n  1. Royal Holloway, University of London | Bachelor's degree, Computer Science with AI | 2022 - 2026 | Grade: 1st Class | Activities and societies: - Google Student Developer's Club | - Programs and Proofs Club | Studying Computer Science with AI at Royal Holloway has been a journey of deep academic exploration and practical application. 🎓 Boasting a 75% average in the first year, I clinched the 5th spot at Royal Hackaway 2023 with a novel AI assistant. As Head of Marketing for the Google Student Developer's Club, I led innovative campaigns and fostered collaborative learning. Gained proficiency in JavaScript, HTML, CSS, React, and Angular. I'm passionate about leveraging AI to tackle real-world challenges | Artificial Intelligence (AI), Technical Documentation and +12 skills\n  2. NIST International School | IB Diploma, High School/Secondary Diplomas and Certificates | Jan 2019 - May 2022 | Grade: 32 | Activities and societies: S.O.A.P - Fights against human trafficking | Rugby Team | Computer Engineering, Economics and +16 skills\n\n[SKILLS]\n  1. NumPy | Software Engineer Fellow at Meta | Endorsed by 1 person in the last 6 months | 1 endorsement | Endorse\n  2. PyTorch | Software Engineer Fellow at Meta | Endorsed by 1 person in the last 6 months | 1 endorsement | Endorse\n\n======================================================\n",
    "persona": ""
  },
  "character_720455": {
    "name": "Aman Sah",
    "id": "720455",
    "scraped_data": "\n================ SCRAPED PROFILE DATA ================\nNAME:     Aman Sah\nHEADLINE: BSc Computer Science | Project Management | System Developer | Technical support | Data Analysis\nLOCATION: He/Him\nPHOTO URL: https://media.licdn.com/dms/image/v2/D4E03AQHCRKle4XPwDQ/profile-displayphoto-shrink_200_200/profile-displayphoto-shrink_200_200/0/1731439782192?e=1767225600&v=beta&t=tO1zp36xW4ixoueJ43R7d-Ld2RFjR9K3w8W2nHIIePs\n\n[ABOUT]\nAs an undergraduate student pursuing a Bachelor's Degree in Computer Science at Brunel University London, I believe that consistency is key to success. I strive to maintain a steady and reliable approach in all my professional endeavors. My active involvement in the creator's community has allowed me to: - Hone my public speaking and hosting skills - Develop strong team management and leadership abilities My coursework in IT has provided me with a solid foundation in: - Programming (Java, Flutter) - Networking (Wireshark) - Database management - Web design - I am passionate about leadership, content creation, and community building. Currently, I am actively seeking placement roles in software engineering to further develop my skills and contribute to innovative projects. If you are looking for a dedicated and driven individual, let's connect and explore how I can contribute to your organization. …see more\n\n[EXPERIENCE]\n  1. Tech & engagement Lead | Brunel Society of Blockchain · Temporary | Mar 2025 - Present · 10 mos | Kingston Lane Uxbridge Middlesex UB8 3PH United Kingdom · On-site | As the Community Engagement Officer at Brunel Blockchain Society, I drive initiatives to foster an inclusive and vibrant community of blockchain enthusiasts. I focus on building meaningful connections between students, industry leaders, and academic networks.\n  2. Research And Development Analyst | Development Platform HCK · Full-time | Sep 2022 - Dec 2023 · 1 yr 4 mos | Kathmandu, Bāgmatī, Nepal · Hybrid | ▪ Improved the Herald Development Platform by designing better MySQL databases, making data flow faster and the system more scalable to meet business needs. | ▪ Redesigned the platform’s look and feel using Figma, working with stakeholders to create a simpler, more user-friendly interface. | ▪ Worked closely with different teams to collect requirements, making sure the final product matched both technical goals and what users needed. | ▪ Connected APIs and set up test plans to ensure everything worked well across different platforms, improving overall stability and performance. | ▪ Managed project tasks using Agile methods, with GitHub for code and Trello for organising work, to keep everything running smoothly. | MySQL, Figma and +10 skills\n  3. Video Editor | Digifly · Contract | Nov 2022 - Dec 2022 · 2 mos | Lalitpur District, Nepal · On-site | -Video Editing: Skillfully editing and refining video footage to tell compelling stories. | -Graphic Design: Using Adobe Illustrator and Photoshop to create and incorporate custom graphics that enhance visual storytelling. | -Project Coordination: Utilizing project management skills to organize and execute video projects from start to finish, ensuring deadlines and quality standards are met. | -Video Production: Overseeing all stages of production, from planning and shooting to post-production. | -Communication & Planning: Leveraging Microsoft Office tools to streamline project workflows | Video Editing, Adobe Illustrator and +7 skills\n  4. DevCorps Creators Community | Full-time · 4 mos | Content Creator | Sep 2022 - Dec 2022 · 4 mos | Naxal, Kathmandu, Nepal · Hybrid | - Member of a creative IT community focused on collaboration and innovation. | - Passionate about technology, bringing valuable skills and knowledge. | - Role involves facilitating knowledge sharing and networking among IT professionals. | - Stay current with industry trends to help others enhance skills and advance careers. | - Experienced in working with developers, designers, and project managers. | - Understand challenges faced by IT professionals and support them in achieving their goals. | - Organize events, lead workshops, and participate in online discussions. | - Committed to supporting the growth of the creator community. | - Proud of my expertise and dedication to this vibrant field. | Social Media, IT industry knowledge and expertise and +4 skills | DevCorps Creators Community on LinkedIn: #socialmediaaddiction #takecontrol #mindfuluse #healthyhabits #balance… | Steering Committee Member | Oct 2022 - Nov 2022 · 2 mos | Kathmandu, Bāgmatī, Nepal · On-site | - Served as a member of the Steering Committee. | - Supervised team management initiatives. | - Developed and implemented marketing strategies. | - Provided support for leadership initiatives. | - Leveraged expertise in social media marketing. | - Utilized proficiency in Microsoft Office. | - Enhanced community engagement. | - Fostered growth within the organization. | Team Management, Leadership and +3 skills | Steering Committe.jpeg | Core Member | Sep 2022 - Oct 2022 · 2 mos | Naxal, Kathmandu, Nepal · On-site | Social Media, Project Management and +3 skills | Podcast Production\n\n[EDUCATION]\n  1. Brunel University of London | Bachelor's degree, Computer Science | Sep 2023 - Jun 2027 | Grade: 1st Predicted | Activities and societies: Brunel+ Gold Award, Brunel Consulting Society, Brunel Climbing Society, @ActiveBrunel and hackathons | Computer Science student at Brunel University London, actively engaged in academic and extracurricular activities to enhance my skills and professional network. | -Coursework includes a strong foundation in programming, data analysis, and project management. | -Active member of societies, including: | -Brunel Consulting Society –> Developing strategic thinking and teamwork skills. | -Brunel Climbing Society – > Building resilience and physical fitness. | -Brunel Archery Society –> Enhancing focus, precision, and discipline. | -Pursuing the Brunel+ Gold Award to demonstrate a commitment to personal and professional growth. | -Actively participating in competitions such as the UK & Ireland Programming Contest (UKIEPC), gaining hands on problem-solving experience. | -Regularly attending Tech events and webinars to expand my knowledge and stay updated with industry trends. | Critical Thinking, Research and +2 skills\n  2. National School of Applied Sciences | +2, Science | Sep 2020 - Aug 2022 | Activities and societies: President Council Club and Arduino Club | Courses: Focused on core subjects like Mathematics, Computer Science, Physics, Chemistry, and English, which provided a multidisciplinary understanding and analytical approach essential for computer science. | Projects: Completed practical projects involving basic programming, algorithm design, and data management, which strengthened my problem-solving skills and coding abilities. | Activities: Participated in computer science clubs and inter-school tech events, which nurtured my interest in software development and networking with peers. | Skills Acquired: Developed proficiency in foundational programming languages, logical reasoning, and analytical skills through hands-on assignments and coursework. | Leadership, Marketing and +3 skills\n\n[SKILLS]\n  1. Systems Management\n  2. Integrated Systems\n\n======================================================\n",
    "persona": ""
  },
  "character_197121": {
    "name": "Rohith Raghunathan Nair",
    "id": "197121",
    "scraped_data": "\n================ SCRAPED PROFILE DATA ================\nNAME:     Rohith Raghunathan Nair\nHEADLINE: AI | Robotics | Deep Learning | Computer Vision | Reinforcement Learning | Generative AI | Model Optimization | Inventor\nLOCATION: 2nd\nPHOTO URL: https://media.licdn.com/dms/image/v2/D4E03AQHZGyVrw90Qsg/profile-displayphoto-shrink_200_200/profile-displayphoto-shrink_200_200/0/1706553431652?e=1767225600&v=beta&t=NXdjasilW8h_q-BfIcg31yMfWz8fdoKDXe-FCcQ3uHk\n\n[ABOUT]\nAs a Robotics and AI Engineer, I believe I possess an extraordinary ability to turn the wildest dreams into tangible reality. Imagination knows no bounds. I have great passion for robotics & artificial intelligence, because of which I am continuously trying to shatter the limits of what is possible. With an unwavering determination to push the boundaries of innovation, I am relentless in my pursuit of greatness, eager to leave an indelible mark on the world of AI. I realised long back that collaboration is the secret ingredient that amplifies achievements beyond measure. Working harmoniously with fellow visionaries and accomplished teams, I draw inspiration from the collective genius, propelling to reach new heights of ingenuity and produce groundbreaking results. Beyond my professional endeavors, I am an ardent explorer of the frontiers of AI and Robotics. Engaging with luminaries at conferences, immersing myself in vibrant online communities, and devouring the latest research papers are all integral parts of my journey. By remaining at the vanguard of AI, I continuously expand my horizons, ensuring that my skills remain at the cutting edge in this ever-evolving landscape. If you seek a Robotics and/or an AI Engineer who embodies unwavering passion, unyielding determination, and an unrelenting commitment to shaping a remarkable future, then let us connect. Together, we will embark on a voyage of unprecedented innovation and transform the ordinary into the extraordinary. Dare to dream the impossible, for I am here to make the extraordinary a tangible reality. …see more\n\n[EXPERIENCE]\n  1. Engineering Manager AI/ML | Quinnox · Full-time | Dec 2023 - Present · 2 yrs 1 mo | London, England, United Kingdom | Computer Vision, Python (Programming Language) and +5 skills\n  2. Engineering Manager AI/ML | Qyrus · Full-time | Nov 2019 - Sep 2023 · 3 yrs 11 mos | London Area, United Kingdom | Computer Vision, Python (Programming Language) and +5 skills\n  3. Lead AI Engineer | Quinnox, Inc. · Full-time | Feb 2018 - Sep 2023 · 5 yrs 8 mos | Deep Learning, Computer Vision and +3 skills\n  4. Software Engineer | IBM | Jul 2014 - Oct 2017 · 3 yrs 4 mos | Bangalore\n\n[EDUCATION]\n  1. King's College London | Master's degree, Robotics | Grade: Distinction | Activities and societies: IEEE, IET, KCL Robotics, RAS | Student Representative | Full time\n  2. Cochin University of Science and Technology | Bachelor's Degree, Computer Science | 2010 - 2014 | Grade: Distinction | Activities and societies: IEEE, CSI, Computer Society | Best Outgoing Student Award | Full time\n\n[SKILLS]\n  1. Team Building\n  2. Text Classification\n\n======================================================\n",
    "persona": ""
  },
  "character_953724": {
    "name": "Farhan Shaikh",
    "id": "953724",
    "scraped_data": "\n================ SCRAPED PROFILE DATA ================\nNAME:     Farhan Shaikh\nHEADLINE: CS @ UoN\nLOCATION: 1st\nPHOTO URL: https://media.licdn.com/dms/image/v2/D4E03AQF6puWDMzjutg/profile-displayphoto-shrink_200_200/B4EZblbMPTHcAY-/0/1747605833215?e=1767225600&v=beta&t=QyAszk2ysNfzVg4Rzqs57yMCsttND1B7iPZ8PIg1o88\n\n[ABOUT]\nI'm Farhan Shaikh, a Computer Science with Artificial Intelligence undergraduate at the University of Nottingham, with a strong passion for building innovative systems and solving complex problems. With hands-on experience across telecom, cybersecurity, and cloud infrastructure, I bring a practical, adaptable mindset to every project I take on. My technical foundation spans Python, Java, R, and more, with a particular focus on AI, cloud-native tools (AWS, GCP), and data-driven systems. I'm also deeply committed to mentoring and education. Outside the classroom, I've been a finalist for TargetJobsUK’s Security Undergraduate of the Year, ESU-Churchill Public Speaking Competition winner, and the team lead for a programming project sponsored by LMAX Group. Please feel free to contact me for collaborations or if you have any questions! Website: https://farhanshaikh.uk/ Github: https://github.com/GitFarhanS …see more\n\n[EXPERIENCE]\n  1. Technical Designer Intern | BT Group · Internship | Jun 2025 - Aug 2025 · 3 mos\n  2. Residential Experience Ambassador | University of Nottingham · Part-time | Sep 2024 - Jun 2025 · 10 mos | Nottingham, England, United Kingdom · On-site | Fostered a supportive hall community by organising inclusive events and offering peer-to-peer wellbeing support to over 200 residents. | Acted as a first point of contact for students, helping resolve accommodation-related issues and signposting university services. | Collaborated with university staff and fellow ambassadors to plan, promote, and deliver social campaigns and community initiatives.\n  3. Global Technology Spring Intern | Bank of America | Apr 2025 - Apr 2025 · 1 mo | Received 2026 Cybersecurity Analyst Summer Internship offer\n\n[EDUCATION]\n  1. University of Nottingham | Bachelor's degree, Computer Science with AI and ML | Sep 2023 - Jun 2026 | Grade: On track for first class honours degree. | Activities and societies: Badminton, NEFS\n  2. Wymondham High Academy | A Levels, Maths, Further Maths, Economics, Computer Science | Sep 2021 - Jul 2023 | Computer Science\n\n[SKILLS]\n  1. Leading Development Teams | Endorse\n  2. Healthcare Industry | Endorse\n\n======================================================\n",
    "persona": ""
  },
  "character_490152": {
    "name": "Abdur Razzak",
    "id": "490152",
    "scraped_data": "\n================ SCRAPED PROFILE DATA ================\nNAME:     Abdur Razzak\nHEADLINE: Machine Learning Engineer @Eli Lilly | Founder of ZenVolt.tech | Deeptech Sustainability | 7 X Hackathon Awards | Advisor @Brunel Society of Blockchain\nLOCATION: He/Him\nPHOTO URL: https://media.licdn.com/dms/image/v2/D4E03AQGLmo4NGFxWwQ/profile-displayphoto-shrink_200_200/profile-displayphoto-shrink_200_200/0/1730368327415?e=1767225600&v=beta&t=f9xo9df3N24NrdIFL175BEa47bAWmBkWIBJLJMMym4s\n\n[ABOUT]\nResults-driven professional with expertise in machine learning, blockchain development and data engineering. Proficient in AWS services, Python, PyTorch, Solidity and Rust, with a strong focus on image and numerical data processing in ML. Experienced in designing scalable data pipelines, developing predictive models, and building decentralized applications (dApps). Passionate about harnessing AI and blockchain to drive innovation and solve complex challenges. •\tWinner of Radix Global Hackathon 2024 •\tWinner(2nd) of Vechain X EasyA X BCG Hackathon @University of Cambridge 2024 •\tWinner of Made In Brunel Software Innovation 2023 •\tWinner of READY Program 2022 •\tWinner of Qi Digital Challenge 2022 With a strong business acumen, I have successfully applied my technical expertise to diverse projects during my time at Eli Lilly and Company. Additionally, I have mentored students, helping them translate business ideas into real-world applications through collaborations with the United Nations and Brunel University of London, further strengthening my confidence in business modelling. Committed to continuous learning and innovation, I bring a unique blend of technical proficiency and strong interpersonal skills. Let's connect for collaboration and knowledge exchange! …see more\n\n[EXPERIENCE]\n  1. Eli Lilly and Company | 2 yrs 6 mos | Basingstoke, England, United Kingdom | Associate Data & Machine Learning Engineer | Full-time | Aug 2025 - Present · 5 mos | On-site | • Developed advanced digital applications that enhanced internal and external workflows, improving delivery speed and user experience. | • Built and optimised business-critical data processing systems to support executive decision-making, improving data accuracy and operational efficiency. | Data Analyst | Part-time | Aug 2024 - Jul 2025 · 1 yr | Hybrid | • Led the feasibility assessment and initiation of software migration, managing the RFP process and vendor coordination to ensure a seamless and efficient transition. | • Served as a Data Engineer on a commercial AI/ML project, designing and optimising data pipelines to streamline model development and deployment. | Systems Analyst (Placement) | Full-time | Jul 2023 - Jul 2024 · 1 yr 1 mo | • Researched and analysed diverse data sources to develop algorithms and data models, leading to a £160,000 annual cost saving by replacing vendor data. | • Led automation project that improved data processing efficiency, saving over 200 hours monthly and allowing Business Analysts to focus on strategic tasks. | • Organised and delivered workshops on data modelling and visualisation, training over 70 individuals and fostering continuous learning across teams.\n  2. President | Brunel Society of Blockchain · Contract | Oct 2024 - Aug 2025 · 11 mos | • Founding President of Brunel Society of Blockchain, leading collaborations with global blockchain companies and growing the society to nearly 100 members within one academic year. | • Launched the “Brilliant on Chain” initiative and raised $14,000 USD in sponsorship for Brunel Hack ’25. | • Led partnerships with 10 UK blockchain societies, positioning Brunel among the top blockchain communities in the country.\n  3. Brunel University of London | Part-time · 2 yrs | Student Ambassador | Jan 2024 - Aug 2025 · 1 yr 8 mos | Ready Program Assistant (Mentor) | Sep 2024 - Dec 2024 · 4 mos | London, England, United Kingdom · On-site | • Received the Top Mentor Award for REDAY 2024 for training students and enhancing their overall performance. | READY Program Assistant(Mentor) | Sep 2023 - Dec 2023 · 4 mos | • Trained 30 Brunel undergraduate, master’s, and PhD students over 10 weeks to develop sustainable business solutions in collaboration with the United Nations.\n  4. Pret A Manger | Part-time · 1 yr 5 mos | Barista | Mar 2023 - Jun 2023 · 4 mos | London Area, United Kingdom | • Learned to make great-quality coffees — loved the experience! | Team member Star | Jun 2022 - Mar 2023 · 10 mos | London, England, United Kingdom | Team member | Feb 2022 - Jun 2022 · 5 mos | London, England, United Kingdom | Customer Service, Interpersonal Communication and +1 skill\n  5. Volunteer | Bangladesh Red Crescent Society (BDRCS) | Jan 2020 - Jan 2022 · 2 yrs 1 mo | Rajshahi, Bangladesh | Communication, Volunteering and +2 skills\n\n[EDUCATION]\n  1. Brunel University of London | BSC(Hons) , Computer Science (Artificial Intelligence) | 2022 - Jun 2025 | Grade: 1st Class Honours (80%+ marks equivalent to cgpa 4) | Activities and societies: President of the Brunel Society of Blockchain, Brunel Plus Gold Award, Winner of Best Individual Award for Leadership by Student Union, Winner of Made In Brunel Software Innovation, READY Program & Qi Digital Award, READY Program Top Tutor, Class Representative of Year-1\n  2. University of Cambridge | Entrepreneurship/Entrepreneurial Studies | Jan 2025 - Jul 2025 | Graduated Accelerate Cambridge as part of Cohort 36, learnt and implemented tech venture development.\n\n[SKILLS]\n  1. Oracle SQL Developer\n  2. Amazon Web Services (AWS) | AWS for Developers: S3\n\n======================================================\n",
    "persona": ""
  },
  "character_249825": {
    "name": "Leonardo O.",
    "id": "249825",
    "scraped_data": "\n================ SCRAPED PROFILE DATA ================\nNAME:     Leonardo O.\nHEADLINE: swe @ Delphi\nLOCATION: he/him\nPHOTO URL: https://media.licdn.com/dms/image/v2/D4D03AQGbA8JHzv-rPw/profile-displayphoto-scale_200_200/B4DZe1woL1GgAc-/0/1751101114744?e=1767225600&v=beta&t=d1xkvK-ou0V5h4orq-MRWMDBKwvGC6dtbk3hCLZZbu4\n\n[ABOUT]\nI'm a passionate and driven guy with a lifelong dream of becoming an engineer, a dream that took root when I was just 5 years old. Over the past 5 years, I've honed my coding skills and worked on various personal projects, where I've discovered a deep appreciation for creating innovative solutions through technology. To me, it's akin to creating art through logical thinking. I'm proud to be bilingual, with proficiency in both Spanish and Portuguese, owing to my Brazilian and Spanish dual nationality. Furthermore, I've been studying English since the age of 4 and have achieved a C1 level certification (ISE III) from Trinity College, demonstrating my proficiency. I've also dabbled in basic French. My interests extend beyond the realm of engineering; I have a keen fascination for philosophy and all sciences. I believe that cultivating a broad understanding of diverse fields is essential in today's interconnected world. I'm excited to embark on my journey in the world of engineering and continue to explore the limitless possibilities technology offers. Let's connect and explore opportunities to learn and grow together. …see more\n\n[EXPERIENCE]\n  1. Software Engineer | Delphi · Full-time | Jul 2025 - Present · 6 mos | Remote | coding stuff\n  2. University Admissions Mentor | Programa Aditus · Part-time | Jun 2025 - Present · 7 mos | Remote | Serve as a mentor in a highly selective academic access program supporting exceptionally talented Spanish students from under-resourced backgrounds in their applications to the world’s most competitive universities. | This role is also a way for me to give back to the Aditus Program, which provided me with invaluable guidance and support during my own university application journey. | Aditus is a nonprofit educational initiative dedicated to bridging the opportunity gap by opening pathways to top global universities for underprivileged students in Spain.\n  3. Software Engineer | Wildfire · Part-time | Nov 2023 - Jun 2025 · 1 yr 8 mos | Remote | - Contributed to the dynamic environment at Wildfire, aligning with my personal initiative Turing AI. | - Balanced schedule to remain an active team member, driven by the project’s vision and objectives. | - Helped Discord communities monetize their dedication and hard work through the Wildfire platform. | - Applied skills developed since the start of my coding journey while exploring new technologies such as hono.js. | - Expanded technical expertise by integrating new tools and practices throughout the project’s development. | - Collaborated with the team toward building a product with extraordinary potential and impact. | TypeScript, Linux and +13 skills | Wildfire\n  4. Owner | Turing AI · Part-time | Dec 2022 - Apr 2024 · 1 yr 5 mos | Remote | Led the development of a high-impact AI Discord bot, reaching a peak of 760,000 registered users and securing its position as the third-largest in its category. Managed the full project lifecycle, from GPU-based AI deployment to web development, API integration, and efficient use of RabbitMQ, Supabase, and Redis. Led a diverse team, fostering collaboration and overcoming challenges to align efforts with project goals. The bot, which significantly enhanced the Discord user experience with innovative AI features, earned recognition within the community and was later acquired by Shapes.inc, a San Francisco startup funded by VC. Open to discussions on this project or exploring collaborations in AI and community-driven platforms. | TypeScript, Linux and +10 skills\n\n[EDUCATION]\n  1. Instituto de Educación Secundaria Virgen de la Cabeza | Bachillerato, Ciencias tecnologícas\n  2. Instituto de Educación Secundaria Virgen de la Cabeza | Educación Secundaria Obligatoria (ESO)\n\n[SKILLS]\n  1. Communication in foreign languages | Youthpass - DIGITAL EDUCATION FOR YOUTH: AI 4.0\n  2. Learning to learn | Youthpass - DIGITAL EDUCATION FOR YOUTH: AI 4.0\n\n======================================================\n",
    "persona": ""
  },
  "character_100680": {
    "name": "Luka Dadiani",
    "id": "100680",
    "scraped_data": "\n================ SCRAPED PROFILE DATA ================\nNAME:     Luka Dadiani\nHEADLINE: Senior Product Designer\nLOCATION: 2nd\nPHOTO URL: https://media.licdn.com/dms/image/v2/D5603AQGZZJNdUFCv6Q/profile-displayphoto-shrink_200_200/profile-displayphoto-shrink_200_200/0/1673539469075?e=1767225600&v=beta&t=5yMGVFdJGXaT_9AmcX9pMnTZjeC5GuqnecZf3VD9yos\n\n[ABOUT]\nWith over four years of experience as a Senior Product Designer at Howden Insurance Brokers Limited, I am part of a globally distributed, agile team within an in-house innovation consultancy. My work focuses on delivering user-centered design solutions by gathering and analyzing both qualitative and quantitative data. I collaborate with stakeholders and users through workshops to collect requirements, communicate progress, and enhance product outcomes. My expertise lies in mobile design, UX, and user interface design, enabling me to craft intuitive and engaging user experiences. I strive to raise the bar for quality by working closely with creative teams to refine positioning and align with organizational goals. By leveraging a data-driven approach, I aim to develop innovative solutions that meet user needs and support business objectives. …see more\n\n[EXPERIENCE]\n  1. Senior Product Designer | Howden Insurance Brokers Limited · Full-time | Nov 2021 - Present · 4 yrs 2 mos | London, England, United Kingdom | Senior Product designer in a globally-distributed, agile team within a large international insurance company. | - Work as Product designer in a globally-distributed, agile team within an in-house innovation consultancy of a large international insurance company. | - Worked closely with the creative director and a brand designer to solicit feedback, refine positioning and raise the bar for quality. | - Ran stakeholder and user workshops to gather product requirements, communicate progress and collect end-user feedback. | - Gathered and analyzed both qualitative and quantitative data to inform data-driven decisions and create user-centered design solutions. | User Interface Design, UX and +3 skills\n  2. Senior UX Designer | Hyperion X · Full-time | Sep 2018 - May 2022 · 3 yrs 9 mos | London, United Kingdom | Work as Product designer in a globally-distributed, agile team within an in-house innovation consultancy of a large international insurance company. | - Partnered with PMs, engineers and marketers to define the user experience for a number of b2b and b2c products. | -Worked closely with the creative director and a brand designer to solicit feedback, refine positioning and raise the bar for quality. | - Ran stakeholder and user workshops to gather product requirements, communicate progress and collect end-user feedback. | - Helped validate startup ideas for internal fund allocation. | - Created a new design system to unify UX across all products.\n  3. Digital Designer | Interoute · Full-time | Jan 2016 - Aug 2018 · 2 yrs 8 mos | London, United Kingdom | UX/UI designer in the marketing team to help deliver high conversion websites for new products and marketing campaigns. | - Managed an external development agency to ensure timley delivery of high-quality websites for marketing campaigns. | - Designed interactive prototypes using Sketch, Invision and code for use in stakeholder discussions and usability testing. | - Redesigned the company intranet after interviewing stakeholders across europe and asia to improve the information architecture.\n  4. Senior Designer | Easynet · Full-time | Feb 2015 - Jan 2016 · 1 yr | London, United Kingdom | Creative Designer within the marketing team worked on updating the brand across all digital and print touchpoints. | - Redesigned the company intranet after interviewing stakeholders across Europe and Asia to improve the information architecture. | - Partnered with stakeholders across the business and around the globe to design new product campaigns across web and print. | - Managed an external developer to ensure correct implementation of prototypes and attention to detail for web and email layouts.\n  5. CTO | PawPost · Full-time | Mar 2014 - Jan 2015 · 11 mos | London, United Kingdom | Cofounder and CTO of a pet focused subscription-box company. Designed and implemented all digital and customer touch points. | - Helped conceive and validate the idea by conducting market research, user interviews and focus groups. | - Designed all packaging including the product boxes, wrapping paper, and various instructions | - Designed the end to end experience from landing page registration to physical product unboxing, digital interaction with the brand and renewal. | - Conducted on-site and offsite focus groups to gather feedback on checkout process and brand. | - Conducted detailed online user tests using user testing.com at every stage of the design. | - Created and implemented a marketing strategy across social media, print and live events. Led the pivot to an instagram influencer-led strategy.\n\n[EDUCATION]\n  1. University of Lancaster | BBA Managment, Management, Marketing, Economics,Finance | 2010 - 2014 | Grade: 2.1 Predicted | Activities and societies: Marketing manager at the marketing society, Communications officer at MUN, Web officer at investment society | Part I subjects: Economics, Management Learning, Management Science, and Marketing. | Part II subjects: Accounting and Finance, Advertising, Management, Management Learning, Management Science, Marketing, Marketing research, Organisational Studies and Strategic Management. | Part III subjects: Accounting and Finance, Management Science, Strategic Marketing, Entrepreneurship, and Tax.\n  2. Gateacre Community Comprehensive | GCSE's, A-level's, English Language, English Literature, History, ICT, Maths, Science, Russian, Geography | 2007 - 2010 | Activities and societies: Debate team, Yearbook team, Charity Committee | A-levels: ICT (A*), General Studies (A*), Business Studies (A), Extended Project (A), History (B); | GCSEs: Maths (A), English (A), RE (A*), Science (A*), History (A), ICT (A*), Russian (A*), Business (A);\n\n[SKILLS]\n  1. Mobile Design | Senior Product Designer at Howden Insurance Brokers Limited | Endorsed by 1 person in the last 6 months | 1 endorsement\n  2. UX | Senior Product Designer at Howden Insurance Brokers Limited | Endorsed by 1 person in the last 6 months | 1 endorsement\n\n======================================================\n",
    "persona": ""
  },
  "character_129521": {
    "name": "Pravin Paratey",
    "id": "129521",
    "scraped_data": "\n================ SCRAPED PROFILE DATA ================\nNAME:     Pravin Paratey\nHEADLINE: Co-founder and CTO at Kaizan\nLOCATION: 3rd\nPHOTO URL: https://media.licdn.com/dms/image/v2/D4D03AQFGUlLfIsT98g/profile-displayphoto-scale_200_200/B4DZolt2y7GsAY-/0/1761569369775?e=1767225600&v=beta&t=FUb_vPFWY_Fk9oRXUPB6HL2xZYciBPDbJ4r458bsnrI\n\n[ABOUT]\n✨ Co-founder/CTO of Kaizan ✨ 🚀 Serial tech builder who's worked at 6 startups, co-founded 3 with 3 successful exits. 💪 Built 100+ high-performance teams across continents in the PE/VC world. 🔥 Always innovating, never settling. 💯 #EntrepreneurForLife #TechLeadership …see more\n\n[EXPERIENCE]\n  1. Co-founder and CTO | Kaizan · Full-time | Mar 2022 - Present · 3 yrs 10 mos | London, England, United Kingdom | The best SaaS tool for Client Success teams. VC-backed. Raised £1.5M. | Building an AI SaaS platform to guide Client Success teams to increase client revenue and satisfaction.\n  2. Advisory Board Member and Angel Investor | Various Companies · Part-time | Apr 2020 - Present · 5 yrs 9 mos | ✨ Advising companies to 10x their output through optimising their Engineering teams in the new AI era | 💰 Angel investor in Indian and British startups\n  3. Head Of Engineering/CTO (Kantan) | OVO · Full-time | May 2018 - Dec 2020 · 2 yrs 8 mos | London, United Kingdom · On-site | Largest energy provider in the UK. PE-Backed. Raised over $200M. Valued at over $3B. | During my time, | 1. OVO grew from 1100 to 11,000 people. | 2. Increased valuation 400M to 3B. | 3. Entered 5 geographies outside UK. | 4. Acquired 5x companies. | 5. Raised £200M from PE. | I was responsible for, | 1. 100-people engineering teams across CORGI, FieldForce (now Kaluza) and Kantan (now OVO X) businesses. | 2. Digital transformation of two of most profitable businesses in the Group - CORGI and FieldForce. | 3. Building common Interview and Progression framework for 700+ software engineers. | 4. Pre and post acquisition activities for 3 businesses.\n  4. Engineering Manager | Facebook · Full-time | Sep 2015 - Oct 2017 · 2 yrs 2 mos | London, United Kingdom | World's largest Social Network. VC-backed. Publicly listed. $835B+ market cap. | I was responsible for Brand Advertising products, 35+ engineers and $2.5B revenue. My teams launched | 1. Brand Awareness Objective ($1B+ ARR). My team launched an entirely new way of measuring and optimising brand awareness. Launched in 2016, it became a $1B+ of new revenue ARR product within 6 months. | 2. Reach Objective ($1B+ ARR). Launched in 2016, grew to a $1B+ ARR product within 6 months. | 3. Brand Polling. Launched in 2015, this product was a way of measuring the brand recall value of an ad shown by polling a user after-the-fact. | 4. Creative Hub. Launched in 2016, it helped creative agencies build better brand ads for advertisers. The product was demonstrated in Cannes in 2016. | 5. Offline Conversions. My team looked at tying an ad shown on the Facebook network to an in-store conversion. It was successful and we were able to build a 60+ people team from it. | 6. Audience Network, An acquisition, re-launched in 2017, I was tasked for improving margins from negative to double digit positive and helped launch new ad formats for mobile devices. | Research and Development (R&D), Customer-Focused Service and +4 skills\n  5. Co-founder and CTO | Hybrid Theory · Full-time | Apr 2011 - Aug 2015 · 4 yrs 5 mos | London, United Kingdom | UK's fastest growing AdTech business. VC-backed. Raised over £5M. Exited to Azerion. | Winner - The UK’s Most Promising Internet Company, First Tuesday 2014 | Finalist - UK Top Tech5 company, The Next Web 2014 | Finalist - Best AdOps team, The Drum Digital Trading Award 2014 | Winner - Digital Business of the Year, Startups Awards 2013 | Winner - Innovative Business of the Year, Startups Awards 2013 | Accelerate 250 Member - UK's fastest growing businesses 2013 | Responsible for the technical strategy, roadmap, planning and executing the vision of the company. Wore multiple hats and actively participated in all aspects of the business including overall P&L, strategy and raising funds. | Responsible for Engineering (24 people), Product(4) and Design(2). Grew these teams from scratch over 3.5 years. Created structure and processes to maximise effectiveness of the above functions. I have had ZERO attrition on my team. | Architected and built v1 of the Ad Technology platform responsible for data ingestion, processing, decisioning, ad tracking and delivery. Requiring no refactoring for 2 years, it consumed over 1 billion events a month comprising of over 85% of the online UK population and participated in over 20 billion RTB auctions each month. | +2\n\n[EDUCATION]\n  1. Indian Institute of Technology, Bombay | BTech, Computer Science | 1999 - 2003 | Activities and societies: System Admin, H-2 | Computer Science with an emphasis on NLP, Information Extraction & Search | Technical Direction, Communication and +3 skills\n\n[SKILLS]\n  1. Leadership | 2 experiences across Rediff.com and 1 other company | Teacher | 2 endorsements\n  2. Venture Capital | 2 endorsements\n\n======================================================\n",
    "persona": ""
  }
}