{
  "company_information": "",
  "character_0001": {
    "name": "Niels Andriesse",
    "id": "0001",
    "persona": "Co-founder and co-CTO of Supermoon AI with a strong background in building AI-first products and developer tools. Previously co-founded Superluminal, an AI data science agent acquired by Supermoon. Experienced in open-source AI research, decentralized systems, and scaling consumer applications to millions of users. Aerospace engineering background with deep systems and applied ML expertise."
  },
  "character_0002": {
    "name": "Abdussalam Popoola",
    "id": "0002",
    "persona": "Web designer and certified Webflow developer focused on building high-conversion websites for startups, SaaS companies, and creative agencies. Strong in UI/UX, Figma-to-Webflow workflows, and interactive design. Computer science undergraduate with experience across freelance, agency, and product design roles."
  },
  "character_0003": {
    "name": "Botir Khaltaev",
    "id": "0003",
    "persona": "Research engineer and computer science student specialising in AI infrastructure and systems engineering. Experience includes LLM training and inference infrastructure at Snyk, Meta FAIR, and OneWeb. Co-founder of an AI model routing startup and active in global AI research and policy communities."
  },
  "character_0004": {
    "name": "Aman Sah",
    "id": "0004",
    "persona": "Computer science undergraduate with experience in system development, data analysis, and community leadership. Active in blockchain and creator communities, with strengths in project coordination, technical support, and public engagement. Seeking software engineering placement roles to deepen hands-on industry experience."
  },
  "character_0005": {
    "name": "Rohith Raghunathan Nair",
    "id": "0005",
    "persona": "Engineering manager and AI/ML leader specialising in robotics, computer vision, and deep learning. Extensive industry experience across IBM and Quinnox, managing AI teams and delivering production-grade ML systems. Holds a distinction-level master’s in robotics from King’s College London."
  },
  "character_0006": {
    "name": "Farhan Shaikh",
    "id": "0006",
    "persona": "Computer science undergraduate specialising in AI and machine learning with hands-on experience in telecoms, cybersecurity, and cloud infrastructure. Interned at BT Group and Bank of America, with a strong track record in leadership, mentoring, and competitive public speaking."
  },
  "character_0007": {
    "name": "Abdur Razzak",
    "id": "0007",
    "persona": "Machine learning engineer with expertise in AI, data engineering, and blockchain systems. Currently at Eli Lilly, delivering production ML solutions and large-scale data pipelines. Founder of a sustainability-focused deeptech venture, multi-time hackathon winner, and experienced student mentor and community leader."
  },
  "character_0008": {
    "name": "Leonardo O.",
    "id": "0008",
    "persona": "Software engineer with a strong entrepreneurial background in AI-powered consumer platforms. Previously built and scaled a large AI Discord bot to hundreds of thousands of users before acquisition. Multilingual developer with experience across TypeScript, distributed systems, and community-driven products."
  },
  "character_0009": {
    "name": "Luka Dadiani",
    "id": "0009",
    "persona": "Senior product designer with extensive experience delivering user-centered digital products in large enterprise and innovation consultancy environments. Strong in UX research, mobile design, and design systems, with a background spanning insurance, SaaS, and early-stage startups."
  },
  "character_0010": {
    "name": "Pravin Paratey",
    "id": "129521",
    "persona": "Serial entrepreneur and CTO with multiple successful exits and extensive experience scaling engineering organisations in VC- and PE-backed companies. Co-founder and CTO of Kaizan, building an AI-powered SaaS platform for client success teams. Former engineering leader at Facebook and OVO, responsible for large-scale products, multi-billion-dollar revenue streams, and global team growth. Deep expertise in technical strategy, AI systems, and high-performance team building."
  },
  "character_0011": {
    "name": "Henry Allen",
    "id": "0002",
    "persona": "Self-taught AI engineer and rapid startup builder focused on turning experimental ideas into scalable AI products. Experience includes voice systems, RAG pipelines, and GPU-powered avatars, as well as executing and exiting a startup in 20 hours. Active community leader running large developer hackathons and partnerships, combining strong technical execution with growth and marketing expertise."
  },
  "character_0012": {
    "name": "Mo Elkhidir",
    "id": "0003",
    "persona": "Senior software engineer and founder with deep backend and infrastructure experience. Former tech lead at Spotify working on large-scale storage systems, retention management, and cloud cost optimisation. Background includes long-term consulting at Netlight and founding multiple startups, with strong expertise in Java, DevOps, distributed systems, and technical leadership."
  },
  "character_0013": {
    "name": "David Gelberg",
    "id": "0004",
    "persona": "AI builder and fastest-exited founder in Europe with a background in machine learning, quantitative development, and product innovation. Founding ML engineer with experience across startups, venture partnerships, and applied AI research. Strong academic foundation in artificial intelligence and computer science, with interests spanning LLM behaviour, quantitative systems, and AI-driven business models."
  }
}