{
  "company_information": "",
  "character_0001": {
    "name": "Niels Andriesse",
    "id": "0001",
    "persona": "Co-founder and co-CTO of Supermoon AI with a strong background in building AI-first products and developer tools. Previously co-founded Superluminal, an AI data science agent acquired by Supermoon. Experienced in open-source AI research, decentralized systems, and scaling consumer applications to millions of users. Aerospace engineering background with deep systems and applied ML expertise."
  },
  "character_0002": {
    "name": "Abdussalam Popoola",
    "id": "0002",
    "persona": "Web designer and certified Webflow developer focused on building high-conversion websites for startups, SaaS companies, and creative agencies. Strong in UI/UX, Figma-to-Webflow workflows, and interactive design. Computer science undergraduate with experience across freelance, agency, and product design roles."
  },
  "character_0003": {
    "name": "Botir Khaltaev",
    "id": "0003",
    "persona": "Research engineer and computer science student specialising in AI infrastructure and systems engineering. Experience includes LLM training and inference infrastructure at Snyk, Meta FAIR, and OneWeb. Co-founder of an AI model routing startup and active in global AI research and policy communities."
  },
  "character_0004": {
    "name": "Aman Sah",
    "id": "0004",
    "persona": "Computer science undergraduate with experience in system development, data analysis, and community leadership. Active in blockchain and creator communities, with strengths in project coordination, technical support, and public engagement. Seeking software engineering placement roles to deepen hands-on industry experience."
  },
  "character_0005": {
    "name": "Rohith Raghunathan Nair",
    "id": "0005",
    "persona": "Engineering manager and AI/ML leader specialising in robotics, computer vision, and deep learning. Extensive industry experience across IBM and Quinnox, managing AI teams and delivering production-grade ML systems. Holds a distinction-level master’s in robotics from King’s College London."
  },
  "character_0006": {
    "name": "Farhan Shaikh",
    "id": "0006",
    "persona": "Computer science undergraduate specialising in AI and machine learning with hands-on experience in telecoms, cybersecurity, and cloud infrastructure. Interned at BT Group and Bank of America, with a strong track record in leadership, mentoring, and competitive public speaking."
  },
  "character_0007": {
    "name": "Abdur Razzak",
    "id": "0007",
    "persona": "Machine learning engineer with expertise in AI, data engineering, and blockchain systems. Currently at Eli Lilly, delivering production ML solutions and large-scale data pipelines. Founder of a sustainability-focused deeptech venture, multi-time hackathon winner, and experienced student mentor and community leader."
  },
  "character_0008": {
    "name": "Leonardo O.",
    "id": "0008",
    "persona": "Software engineer with a strong entrepreneurial background in AI-powered consumer platforms. Previously built and scaled a large AI Discord bot to hundreds of thousands of users before acquisition. Multilingual developer with experience across TypeScript, distributed systems, and community-driven products."
  },
  "character_0009": {
    "name": "Luka Dadiani",
    "id": "0009",
    "persona": "Senior product designer with extensive experience delivering user-centered digital products in large enterprise and innovation consultancy environments. Strong in UX research, mobile design, and design systems, with a background spanning insurance, SaaS, and early-stage startups."
  },
  "character_0010": {
    "name": "Pravin Paratey",
    "id": "129521",
    "scraped_data": "\n================ SCRAPED PROFILE DATA ================\nNAME:     Pravin Paratey\nHEADLINE: Co-founder and CTO at Kaizan\nLOCATION: 3rd\nPHOTO URL: https://media.licdn.com/dms/image/v2/D4D03AQFGUlLfIsT98g/profile-displayphoto-scale_200_200/B4DZolt2y7GsAY-/0/1761569369775?e=1767225600&v=beta&t=FUb_vPFWY_Fk9oRXUPB6HL2xZYciBPDbJ4r458bsnrI\n\n[ABOUT]\n✨ Co-founder/CTO of Kaizan ✨ 🚀 Serial tech builder who's worked at 6 startups, co-founded 3 with 3 successful exits. 💪 Built 100+ high-performance teams across continents in the PE/VC world. 🔥 Always innovating, never settling. 💯 #EntrepreneurForLife #TechLeadership …see more\n\n[EXPERIENCE]\n  1. Co-founder and CTO | Kaizan · Full-time | Mar 2022 - Present · 3 yrs 10 mos | London, England, United Kingdom | The best SaaS tool for Client Success teams. VC-backed. Raised £1.5M. | Building an AI SaaS platform to guide Client Success teams to increase client revenue and satisfaction.\n  2. Advisory Board Member and Angel Investor | Various Companies · Part-time | Apr 2020 - Present · 5 yrs 9 mos | ✨ Advising companies to 10x their output through optimising their Engineering teams in the new AI era | 💰 Angel investor in Indian and British startups\n  3. Head Of Engineering/CTO (Kantan) | OVO · Full-time | May 2018 - Dec 2020 · 2 yrs 8 mos | London, United Kingdom · On-site | Largest energy provider in the UK. PE-Backed. Raised over $200M. Valued at over $3B. | During my time, | 1. OVO grew from 1100 to 11,000 people. | 2. Increased valuation 400M to 3B. | 3. Entered 5 geographies outside UK. | 4. Acquired 5x companies. | 5. Raised £200M from PE. | I was responsible for, | 1. 100-people engineering teams across CORGI, FieldForce (now Kaluza) and Kantan (now OVO X) businesses. | 2. Digital transformation of two of most profitable businesses in the Group - CORGI and FieldForce. | 3. Building common Interview and Progression framework for 700+ software engineers. | 4. Pre and post acquisition activities for 3 businesses.\n  4. Engineering Manager | Facebook · Full-time | Sep 2015 - Oct 2017 · 2 yrs 2 mos | London, United Kingdom | World's largest Social Network. VC-backed. Publicly listed. $835B+ market cap. | I was responsible for Brand Advertising products, 35+ engineers and $2.5B revenue. My teams launched | 1. Brand Awareness Objective ($1B+ ARR). My team launched an entirely new way of measuring and optimising brand awareness. Launched in 2016, it became a $1B+ of new revenue ARR product within 6 months. | 2. Reach Objective ($1B+ ARR). Launched in 2016, grew to a $1B+ ARR product within 6 months. | 3. Brand Polling. Launched in 2015, this product was a way of measuring the brand recall value of an ad shown by polling a user after-the-fact. | 4. Creative Hub. Launched in 2016, it helped creative agencies build better brand ads for advertisers. The product was demonstrated in Cannes in 2016. | 5. Offline Conversions. My team looked at tying an ad shown on the Facebook network to an in-store conversion. It was successful and we were able to build a 60+ people team from it. | 6. Audience Network, An acquisition, re-launched in 2017, I was tasked for improving margins from negative to double digit positive and helped launch new ad formats for mobile devices. | Research and Development (R&D), Customer-Focused Service and +4 skills\n  5. Co-founder and CTO | Hybrid Theory · Full-time | Apr 2011 - Aug 2015 · 4 yrs 5 mos | London, United Kingdom | UK's fastest growing AdTech business. VC-backed. Raised over £5M. Exited to Azerion. | Winner - The UK’s Most Promising Internet Company, First Tuesday 2014 | Finalist - UK Top Tech5 company, The Next Web 2014 | Finalist - Best AdOps team, The Drum Digital Trading Award 2014 | Winner - Digital Business of the Year, Startups Awards 2013 | Winner - Innovative Business of the Year, Startups Awards 2013 | Accelerate 250 Member - UK's fastest growing businesses 2013 | Responsible for the technical strategy, roadmap, planning and executing the vision of the company. Wore multiple hats and actively participated in all aspects of the business including overall P&L, strategy and raising funds. | Responsible for Engineering (24 people), Product(4) and Design(2). Grew these teams from scratch over 3.5 years. Created structure and processes to maximise effectiveness of the above functions. I have had ZERO attrition on my team. | Architected and built v1 of the Ad Technology platform responsible for data ingestion, processing, decisioning, ad tracking and delivery. Requiring no refactoring for 2 years, it consumed over 1 billion events a month comprising of over 85% of the online UK population and participated in over 20 billion RTB auctions each month. | +2\n\n[EDUCATION]\n  1. Indian Institute of Technology, Bombay | BTech, Computer Science | 1999 - 2003 | Activities and societies: System Admin, H-2 | Computer Science with an emphasis on NLP, Information Extraction & Search | Technical Direction, Communication and +3 skills\n\n[SKILLS]\n  1. Leadership | 2 experiences across Rediff.com and 1 other company | Teacher | 2 endorsements\n  2. Venture Capital | 2 endorsements\n\n======================================================\n",
    "persona": ""
  },
  "character_227243": {
    "name": "Henry Allen",
    "id": "227243",
    "scraped_data": "\n================ SCRAPED PROFILE DATA ================\nNAME:     Henry Allen\nHEADLINE: AI Engineer | Eurotech Fellow 🇪🇺 | Lovable Ambassador\nLOCATION: He/Him\nPHOTO URL: https://media.licdn.com/dms/image/v2/D4E03AQG2Eh083L-x8g/profile-displayphoto-shrink_200_200/B4EZZ833mnHcAc-/0/1745851743051?e=1767225600&v=beta&t=nr3CD_ZrGmnyVSgR9krjFyJ-Pihxk-TlUd5VTvijBJo\n\n[ABOUT]\nAfter high school, I felt the itch to build rather than take the traditional path. Since then, I’ve grown into a self-taught AI engineer turning wild ideas into scalable products, from voice systems and RAG pipelines to a 20-hour startup exit and GPU-powered avatars for 10,000+ London Marathon runners. I also lead London’s largest developer community, running hackathons and partnerships, and along the way I’ve made enough API calls to make rate limiters cry. …see more\n\n[EXPERIENCE]\n  1. Fellow | EuroTech Federation | Jun 2025 - Present · 7 mos | Federating the best builders of today to create the Europe of tomorrow\n  2. Co-Founder | the20hr.co | Aug 2025 - Aug 2025 · 1 mo | Stockholm, Stockholm County, Sweden | Built, launched & Sold a company in 20 hours. Becoming the fastest exited founder in Europe. Scaled to €10k in revenue before acquisition.\n  3. AI Engineer | Fifty Five and Five · Full-time | Oct 2024 - Jul 2025 · 10 mos | London Area, United Kingdom · On-site | Developed and deployed AI-driven marketing solutions, transforming client strategies through full-stack development, automation, and personalised experiences. | Artificial Intelligence (AI) and Marketing Strategy\n  4. Freelance Marketing Services | Infalyze · Self-employed | Oct 2022 - Jun 2025 · 2 yrs 9 mos | London Area, United Kingdom · On-site | Managed year-long Facebook marketing campaigns for Clients, overseeing ad spends of over £10,000 and achieving a positive Return on Ad Spend ROAS, significantly boosting client revenue through strategic ad placements and lead funnels. | Facebook Marketing, Facebook Ads and +4 skills\n  5. Growth Operator | 6omb AI · Full-time | Aug 2024 - Oct 2024 · 3 mos | United States · Remote | Optimised funnels which generated 70+ booked appointments in under 30 days and over time my impact helped to generate $9k+ during a launch. | Helped Lead a Community of AI enthusiasts into adopting AI, taught how to leverage the power of Voice AI technologies by translating technical concepts into lamens terms for members. | Marketing Strategy, Community Development and +4 skills\n\n[EDUCATION]\n  1. Reddam House Berkshire | GCSE's & CCF | Sep 2017 - Jul 2021 | CCF Army\n  2. Farnborough College of Technology | Computer Science | Sep 2021 - Jul 2023 | Grade: Distinction | Software Architecture, Computer Science and +1 skill\n\n[SKILLS]\n  1. Go-to-Market Strategy | Freelance Marketing Services at Infalyze | Endorse\n  2. Entrepreneurial Organizations | Endorse\n\n======================================================\n",
    "persona": ""
  },
  "character_018513": {
    "name": "Mo Elkhidir",
    "id": "018513",
    "scraped_data": "\n================ SCRAPED PROFILE DATA ================\nNAME:     Mo Elkhidir\nHEADLINE: Tweeting on LinkedIn full-time | literally changing marketing forever part-time.\nLOCATION: 2nd\nPHOTO URL: https://media.licdn.com/dms/image/v2/C4E03AQG_cikh16Ofmg/profile-displayphoto-shrink_200_200/profile-displayphoto-shrink_200_200/0/1602750930201?e=1767225600&v=beta&t=3F9xX3h5Z7qWEmKAbUilEi66dyurk_baede1p_BiO1o\n\n[ABOUT]\nAn experienced software developer who worked as a full-stack engineer with more interest in the back-end. Self-motivated, hardworking and spend most of his time coding. Familiar with financial services solutions, hybrid mobile and desktop applications development and web APIs designing and implementation.\n\n[EXPERIENCE]\n  1. Co-Founder | Epiminds · Full-time | May 2025 - Present · 8 mos\n  2. Founder | xavia | Feb 2024 - Apr 2025 · 1 yr 3 mos | Stockholm, Stockholm County, Sweden\n  3. Consultant | Netlight · Full-time | May 2017 - Feb 2025 · 7 yrs 10 mos | Stockholm, Sweden\n  4. Spotify | Contract · 1 yr 9 mos | Stockholm, Stockholm County, Sweden · Hybrid | Tech Lead - Blob Storage | Feb 2023 - Sep 2023 · 8 mos | As the Tech Lead for Blob Storage at Spotify, I was accountable for shaping the technical direction for the product in 2023. My role included architecting and spearheading the implementation of a robust retention management system. I also took the lead in rolling out a tiered storage solution to optimize resource usage. Moreover, I also maintained close collaboration with Google to guarantee that essential functionalities are built into Google Cloud Storage, thereby synergizing our efforts for optimal results. | Data-Driven Insights, Strategic Collaboration and +5 skills | Senior Software Engineer | Jan 2022 - Jan 2023 · 1 yr 1 mo | As a key contributor within Spotify's Storage PA, I've played a significant role in boosting Infrastructure as Code (IaC) adoption for our RDBMS to 80%. I've also been involved in enhancing autoscaling and backup mechanisms for Bigtable. Additionally, I worked on a specialized database client to better the developer user experience. I've also contributed to cost-optimization strategies for our key-value stores to support sustainable growth. | Java, DevOps and +2 skills\n  5. Senior Software Engineer | Kry · Contract | May 2021 - Dec 2021 · 8 mos | Stockholm, Stockholm County, Sweden · On-site | When the Clinican Experience team at Kry was in its early stages of splitting into two separate units, I helped stakeholders establish a process for the transition. I was also involved in recruiting efforts, which doubled the team size from 3 to 6 engineers in a span of 3 months. My technical background played a role in aligning the team with Kry's new engineering strategy focused on team autonomy. I contributed to reducing dependencies on legacy systems and other Kry teams, enabling the CareSE team to have its own services, development environments, and technical roadmap. | Java, DevOps and +3 skills\n\n[EDUCATION]\n  1. KTH Royal Institute of Technology | Master's degree, Machine Learning | suspnded\n  2. University of Khartoum | Bachelor's degree, Software Engineering | Grade: 7.2/10\n\n[SKILLS]\n  1. Cross-functional Team Leadership | Tech Lead - Blob Storage at Spotify | Endorsed by 2 people in the last 6 months | 5 endorsements\n  2. Python (Programming Language) | Tech Lead - Blob Storage at Spotify | Endorsed by 1 person in the last 6 months | 3 endorsements\n\n======================================================\n",
    "persona": ""
  },
  "character_637094": {
    "name": "David Gelberg",
    "id": "637094",
    "scraped_data": "\n================ SCRAPED PROFILE DATA ================\nNAME:     David Gelberg\nHEADLINE: Fastest Exited Founder in Europe | AI Builder\nLOCATION: He/Him\nPHOTO URL: https://media.licdn.com/dms/image/v2/C5603AQGL4dq7JqHwrA/profile-displayphoto-shrink_200_200/profile-displayphoto-shrink_200_200/0/1577458350906?e=1767225600&v=beta&t=OXhtkB3zF3S33mZR4p-QuqEiDDePlD0uJ3c3gm7tGsU\n\n[ABOUT]\nActively exploring opportunities in AI, backed by a unique blend of product management and international sales expertise. Keen interest in emergent LLM behaviour, cultural simulacra, narrative grammars, and GPT-4 Language models. Passionate about merging tech and business for innovation. Open to collaborations that shape the AI future. Let's connect!\n\n[EXPERIENCE]\n  1. Founding ML Engineer & Investor Relations Lead | Warestack | Aug 2023 - Present · 2 yrs 5 mos | London Area, United Kingdom\n  2. Venture Partner | V11 | Aug 2025 - Present · 5 mos | London Area, United Kingdom\n  3. Fractional Innovation Officer | Foresight | Jun 2023 - Present · 2 yrs 7 mos | London Area, United Kingdom\n  4. Quantitative Developer | Stealth Startup · Freelance | Sep 2019 - Present · 6 yrs 4 mos | Sports betting industry + HFT (FX)\n  5. Co-Founder | the20hr.co (acq. Revel) | Aug 2025 - Aug 2025 · 1 mo | Stockholm, Stockholm County, Sweden | Built, launched and sold a company in 20 hours.\n\n[EDUCATION]\n  1. Imperial College London | Master of Science - MS, Artificial Intelligence | Activities and societies: Algorithmic Trading, AI, Entrepreneurs\n  2. Birkbeck, University of London | Bachelor of Science - BS, Computer Science | Grade: First Class Honours | Activities and societies: Chair of Council, Academic representative, NUS Delegate\n\n[SKILLS]\n  1. Algorithms | Endorsed by 1 person in the last 6 months | 2 endorsements | Endorse\n  2. Deep Learning | Endorsed by 1 person in the last 6 months | 5 endorsements | Endorse\n\n======================================================\n",
    "persona": ""
  }
}