{
  "company_information": "",
  "character_0001": {
    "name": "Henry Allen",
    "id": "0001",
    "persona": "Self-taught AI engineer and entrepreneur focused on building and scaling AI-driven products. Experienced in voice systems, RAG pipelines, and rapid startup execution, including a 20-hour company exit. Active community leader running large developer hackathons and partnerships. Background spans AI engineering, growth, and marketing with strong hands-on technical and commercial execution."
  },
  "character_0002": {
    "name": "Roméo Walter",
    "id": "0002",
    "persona": "Venture capital investor specialising in early-stage European software companies from Seed to Series B. Vice President at Dawn Capital with prior experience at Fly Ventures and Kerala Ventures. Strong background in economics, finance, and mathematics, with experience in strategy, board observation, and growth operations."
  },
  "character_0003": {
    "name": "Alexandra Tsylnitska",
    "id": "0003",
    "persona": "Early-stage venture investor backing Seed+ European founders, currently at Dawn Capital. Previously an investor at Seedcamp with experience in fintech, entertainment tech, and growth partnerships. Former finance professional with a strong academic background in economics from Cambridge and Columbia."
  },
  "character_0004": {
    "name": "Zoe (Ziwen) Qin",
    "id": "0004",
    "persona": "Venture capital investor at Dawn Capital with a background in physics and machine learning. Active board member across multiple AI and fintech startups. Also deeply involved in ecosystem building through hackathons and community initiatives, combining technical fluency with early-stage investing."
  },
  "character_0005": {
    "name": "Ties Boukema",
    "id": "0005",
    "persona": "Head of Data, Tech & AI at Dawn Capital, leading proprietary AI platforms and data strategy. Co-founder of Cognitas and former Google analytics and data science leader. Extensive experience in applied machine learning, data engineering, and teaching technical skills, with a strong focus on AI-enabled relationship intelligence."
  },
  "character_0006": {
    "name": "An N.",
    "id": "0006",
    "persona": "Investor relations analyst at Dawn Capital with experience supporting early-stage and growth-stage venture operations. Background includes founder support roles, project work at Goldman Sachs, and leadership in university organisations. Strong skills in project management, stakeholder communication, and operations."
  },
  "character_0007": {
    "name": "Haakon Overli",
    "id": "0007",
    "persona": "General Partner and founder at Dawn Capital with nearly two decades of venture capital experience. Focused on fintech and SaaS investments across Europe, serving on multiple boards. Background in economics and mathematics with deep expertise in scaling high-growth technology companies."
  },
  "character_0008": {
    "name": "Skye Fletcher",
    "id": "0008",
    "persona": "Venture capital investor at Dawn Capital focused on B2B software and fintech. Former Bain & Company consultant with experience in commercial due diligence and value creation. Strong engineering background from Cambridge, combining analytical rigor with early-stage investing."
  },
  "character_0009": {
    "name": "Jordan",
    "id": "0009",
    "persona": "The presenter. A passionate entrepreneur pitching their startup idea to the VCs."
  },
  "character_0010": {
    "name": "Niels Andriesse",
    "id": "0010",
    "persona": "Tech entrepreneur and hackathon participant with experience in decentralized systems and privacy-focused applications."
  },
  "character_0011": {
    "name": "Abdussalam Popoola",
    "id": "0011",
    "persona": "Software developer and hackathon participant passionate about fintech and payment solutions in emerging markets."
  },
  "character_0012": {
    "name": "Botir Khaltaev",
    "id": "0012",
    "persona": "AI engineer and hackathon participant focused on machine learning applications and automation."
  },
  "character_0013": {
    "name": "Aman Sah",
    "id": "0013",
    "persona": "Full-stack developer and hackathon participant interested in education technology and social impact startups."
  },
  "character_0014": {
    "name": "Rohith Raghunathan Nair",
    "id": "0014",
    "persona": "Data scientist and hackathon participant with expertise in analytics and business intelligence solutions."
  },
  "character_0015": {
    "name": "Farhan Shaikh",
    "id": "0015",
    "persona": "Mobile developer and hackathon participant focused on consumer apps and user experience design."
  },
  "character_0016": {
    "name": "Abdur Razzak",
    "id": "0016",
    "persona": "Backend engineer and hackathon participant experienced in scalable systems and cloud architecture."
  },
  "character_0017": {
    "name": "Leonardo O.",
    "id": "0017",
    "persona": "Product designer and hackathon participant passionate about creating intuitive user interfaces."
  },
  "character_0018": {
    "name": "Luka Dadiani",
    "id": "0018",
    "persona": "Blockchain developer and hackathon participant interested in Web3 and decentralized finance."
  },
  "character_0019": {
    "name": "Pravin Paratey",
    "id": "0019",
    "persona": "Senior engineer and hackathon participant with deep experience in system design and technical leadership."
  },
  "character_0020": {
    "name": "Mo Elkhidir",
    "id": "0020",
    "persona": "Growth engineer and hackathon participant focused on data-driven marketing and user acquisition."
  },
  "character_0021": {
    "name": "David Gelberg",
    "id": "0021",
    "persona": "Startup founder and hackathon participant with experience launching and scaling tech companies."
  }
}